class Point:
    'Класс для представления координат точек на плоскости'
    color = 'red'
    circle = 2


# Итог 1-ого занятия:
# функции:
# getattr(obj, name [, default]) - возвращает значение атрибута объекта.
# hasattr(obj, name) - проверяет на наличие атрибута name в obj.
# setattr(obj, name, value) - задает значение атрибута (если атрибут не существует, то он создается).
# delattr(obj, name) - удаляет атрибут с именем name.

# переменные:
# __doc__ - содержит строку с описанием класса.
# __dict__ - содержит набор атриботов экземпляра класса.